###################################################################

# Created by write_sdc on Fri Dec 27 14:23:01 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
#set_wire_load_mode top
#set_wire_load_model -name enG30K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_data[7]}]
set_load -pin_load 0.05 [get_ports {out_data[6]}]
set_load -pin_load 0.05 [get_ports {out_data[5]}]
set_load -pin_load 0.05 [get_ports {out_data[4]}]
set_load -pin_load 0.05 [get_ports {out_data[3]}]
set_load -pin_load 0.05 [get_ports {out_data[2]}]
set_load -pin_load 0.05 [get_ports {out_data[1]}]
set_load -pin_load 0.05 [get_ports {out_data[0]}]
set_load -pin_load 0.05 [get_ports {awid_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {awid_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {awid_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {awid_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[31]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[30]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[29]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[28]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[27]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[26]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[25]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[24]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[23]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[22]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[21]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[20]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[19]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[18]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[17]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[16]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[15]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[14]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[13]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[12]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[11]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[10]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[9]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[8]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[7]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[6]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[5]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[4]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {awaddr_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {awsize_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {awsize_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {awsize_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {awburst_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {awburst_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[7]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[6]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[5]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[4]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {awlen_s_inf[0]}]
set_load -pin_load 0.05 [get_ports awvalid_s_inf]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[127]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[126]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[125]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[124]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[123]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[122]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[121]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[120]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[119]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[118]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[117]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[116]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[115]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[114]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[113]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[112]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[111]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[110]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[109]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[108]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[107]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[106]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[105]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[104]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[103]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[102]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[101]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[100]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[99]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[98]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[97]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[96]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[95]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[94]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[93]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[92]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[91]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[90]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[89]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[88]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[87]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[86]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[85]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[84]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[83]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[82]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[81]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[80]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[79]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[78]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[77]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[76]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[75]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[74]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[73]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[72]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[71]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[70]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[69]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[68]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[67]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[66]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[65]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[64]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[63]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[62]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[61]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[60]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[59]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[58]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[57]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[56]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[55]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[54]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[53]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[52]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[51]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[50]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[49]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[48]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[47]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[46]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[45]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[44]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[43]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[42]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[41]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[40]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[39]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[38]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[37]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[36]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[35]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[34]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[33]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[32]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[31]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[30]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[29]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[28]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[27]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[26]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[25]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[24]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[23]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[22]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[21]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[20]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[19]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[18]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[17]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[16]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[15]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[14]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[13]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[12]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[11]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[10]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[9]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[8]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[7]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[6]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[5]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[4]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {wdata_s_inf[0]}]
set_load -pin_load 0.05 [get_ports wlast_s_inf]
set_load -pin_load 0.05 [get_ports wvalid_s_inf]
set_load -pin_load 0.05 [get_ports bready_s_inf]
set_load -pin_load 0.05 [get_ports {arid_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {arid_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {arid_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {arid_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[31]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[30]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[29]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[28]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[27]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[26]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[25]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[24]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[23]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[22]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[21]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[20]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[19]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[18]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[17]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[16]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[15]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[14]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[13]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[12]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[11]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[10]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[9]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[8]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[7]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[6]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[5]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[4]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {araddr_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[7]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[6]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[5]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[4]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[3]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {arlen_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {arsize_s_inf[2]}]
set_load -pin_load 0.05 [get_ports {arsize_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {arsize_s_inf[0]}]
set_load -pin_load 0.05 [get_ports {arburst_s_inf[1]}]
set_load -pin_load 0.05 [get_ports {arburst_s_inf[0]}]
set_load -pin_load 0.05 [get_ports arvalid_s_inf]
set_load -pin_load 0.05 [get_ports rready_s_inf]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports {in_pic_no[3]}]
set_max_capacitance 0.15 [get_ports {in_pic_no[2]}]
set_max_capacitance 0.15 [get_ports {in_pic_no[1]}]
set_max_capacitance 0.15 [get_ports {in_pic_no[0]}]
set_max_capacitance 0.15 [get_ports {in_mode[1]}]
set_max_capacitance 0.15 [get_ports {in_mode[0]}]
set_max_capacitance 0.15 [get_ports {in_ratio_mode[1]}]
set_max_capacitance 0.15 [get_ports {in_ratio_mode[0]}]
set_max_capacitance 0.15 [get_ports awready_s_inf]
set_max_capacitance 0.15 [get_ports wready_s_inf]
set_max_capacitance 0.15 [get_ports {bid_s_inf[3]}]
set_max_capacitance 0.15 [get_ports {bid_s_inf[2]}]
set_max_capacitance 0.15 [get_ports {bid_s_inf[1]}]
set_max_capacitance 0.15 [get_ports {bid_s_inf[0]}]
set_max_capacitance 0.15 [get_ports {bresp_s_inf[1]}]
set_max_capacitance 0.15 [get_ports {bresp_s_inf[0]}]
set_max_capacitance 0.15 [get_ports bvalid_s_inf]
set_max_capacitance 0.15 [get_ports arready_s_inf]
set_max_capacitance 0.15 [get_ports {rid_s_inf[3]}]
set_max_capacitance 0.15 [get_ports {rid_s_inf[2]}]
set_max_capacitance 0.15 [get_ports {rid_s_inf[1]}]
set_max_capacitance 0.15 [get_ports {rid_s_inf[0]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[127]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[126]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[125]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[124]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[123]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[122]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[121]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[120]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[119]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[118]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[117]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[116]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[115]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[114]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[113]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[112]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[111]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[110]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[109]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[108]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[107]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[106]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[105]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[104]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[103]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[102]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[101]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[100]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[99]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[98]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[97]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[96]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[95]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[94]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[93]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[92]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[91]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[90]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[89]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[88]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[87]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[86]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[85]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[84]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[83]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[82]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[81]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[80]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[79]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[78]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[77]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[76]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[75]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[74]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[73]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[72]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[71]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[70]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[69]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[68]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[67]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[66]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[65]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[64]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[63]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[62]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[61]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[60]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[59]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[58]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[57]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[56]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[55]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[54]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[53]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[52]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[51]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[50]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[49]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[48]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[47]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[46]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[45]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[44]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[43]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[42]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[41]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[40]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[39]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[38]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[37]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[36]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[35]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[34]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[33]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[32]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[31]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[30]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[29]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[28]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[27]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[26]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[25]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[24]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[23]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[22]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[21]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[20]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[19]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[18]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[17]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[16]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[15]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[14]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[13]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[12]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[11]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[10]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[9]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[8]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[7]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[6]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[5]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[4]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[3]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[2]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[1]}]
set_max_capacitance 0.15 [get_ports {rdata_s_inf[0]}]
set_max_capacitance 0.15 [get_ports {rresp_s_inf[1]}]
set_max_capacitance 0.15 [get_ports {rresp_s_inf[0]}]
set_max_capacitance 0.15 [get_ports rlast_s_inf]
set_max_capacitance 0.15 [get_ports rvalid_s_inf]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports {in_pic_no[3]}]
set_max_fanout 10 [get_ports {in_pic_no[2]}]
set_max_fanout 10 [get_ports {in_pic_no[1]}]
set_max_fanout 10 [get_ports {in_pic_no[0]}]
set_max_fanout 10 [get_ports {in_mode[1]}]
set_max_fanout 10 [get_ports {in_mode[0]}]
set_max_fanout 10 [get_ports {in_ratio_mode[1]}]
set_max_fanout 10 [get_ports {in_ratio_mode[0]}]
set_max_fanout 10 [get_ports awready_s_inf]
set_max_fanout 10 [get_ports wready_s_inf]
set_max_fanout 10 [get_ports {bid_s_inf[3]}]
set_max_fanout 10 [get_ports {bid_s_inf[2]}]
set_max_fanout 10 [get_ports {bid_s_inf[1]}]
set_max_fanout 10 [get_ports {bid_s_inf[0]}]
set_max_fanout 10 [get_ports {bresp_s_inf[1]}]
set_max_fanout 10 [get_ports {bresp_s_inf[0]}]
set_max_fanout 10 [get_ports bvalid_s_inf]
set_max_fanout 10 [get_ports arready_s_inf]
set_max_fanout 10 [get_ports {rid_s_inf[3]}]
set_max_fanout 10 [get_ports {rid_s_inf[2]}]
set_max_fanout 10 [get_ports {rid_s_inf[1]}]
set_max_fanout 10 [get_ports {rid_s_inf[0]}]
set_max_fanout 10 [get_ports {rdata_s_inf[127]}]
set_max_fanout 10 [get_ports {rdata_s_inf[126]}]
set_max_fanout 10 [get_ports {rdata_s_inf[125]}]
set_max_fanout 10 [get_ports {rdata_s_inf[124]}]
set_max_fanout 10 [get_ports {rdata_s_inf[123]}]
set_max_fanout 10 [get_ports {rdata_s_inf[122]}]
set_max_fanout 10 [get_ports {rdata_s_inf[121]}]
set_max_fanout 10 [get_ports {rdata_s_inf[120]}]
set_max_fanout 10 [get_ports {rdata_s_inf[119]}]
set_max_fanout 10 [get_ports {rdata_s_inf[118]}]
set_max_fanout 10 [get_ports {rdata_s_inf[117]}]
set_max_fanout 10 [get_ports {rdata_s_inf[116]}]
set_max_fanout 10 [get_ports {rdata_s_inf[115]}]
set_max_fanout 10 [get_ports {rdata_s_inf[114]}]
set_max_fanout 10 [get_ports {rdata_s_inf[113]}]
set_max_fanout 10 [get_ports {rdata_s_inf[112]}]
set_max_fanout 10 [get_ports {rdata_s_inf[111]}]
set_max_fanout 10 [get_ports {rdata_s_inf[110]}]
set_max_fanout 10 [get_ports {rdata_s_inf[109]}]
set_max_fanout 10 [get_ports {rdata_s_inf[108]}]
set_max_fanout 10 [get_ports {rdata_s_inf[107]}]
set_max_fanout 10 [get_ports {rdata_s_inf[106]}]
set_max_fanout 10 [get_ports {rdata_s_inf[105]}]
set_max_fanout 10 [get_ports {rdata_s_inf[104]}]
set_max_fanout 10 [get_ports {rdata_s_inf[103]}]
set_max_fanout 10 [get_ports {rdata_s_inf[102]}]
set_max_fanout 10 [get_ports {rdata_s_inf[101]}]
set_max_fanout 10 [get_ports {rdata_s_inf[100]}]
set_max_fanout 10 [get_ports {rdata_s_inf[99]}]
set_max_fanout 10 [get_ports {rdata_s_inf[98]}]
set_max_fanout 10 [get_ports {rdata_s_inf[97]}]
set_max_fanout 10 [get_ports {rdata_s_inf[96]}]
set_max_fanout 10 [get_ports {rdata_s_inf[95]}]
set_max_fanout 10 [get_ports {rdata_s_inf[94]}]
set_max_fanout 10 [get_ports {rdata_s_inf[93]}]
set_max_fanout 10 [get_ports {rdata_s_inf[92]}]
set_max_fanout 10 [get_ports {rdata_s_inf[91]}]
set_max_fanout 10 [get_ports {rdata_s_inf[90]}]
set_max_fanout 10 [get_ports {rdata_s_inf[89]}]
set_max_fanout 10 [get_ports {rdata_s_inf[88]}]
set_max_fanout 10 [get_ports {rdata_s_inf[87]}]
set_max_fanout 10 [get_ports {rdata_s_inf[86]}]
set_max_fanout 10 [get_ports {rdata_s_inf[85]}]
set_max_fanout 10 [get_ports {rdata_s_inf[84]}]
set_max_fanout 10 [get_ports {rdata_s_inf[83]}]
set_max_fanout 10 [get_ports {rdata_s_inf[82]}]
set_max_fanout 10 [get_ports {rdata_s_inf[81]}]
set_max_fanout 10 [get_ports {rdata_s_inf[80]}]
set_max_fanout 10 [get_ports {rdata_s_inf[79]}]
set_max_fanout 10 [get_ports {rdata_s_inf[78]}]
set_max_fanout 10 [get_ports {rdata_s_inf[77]}]
set_max_fanout 10 [get_ports {rdata_s_inf[76]}]
set_max_fanout 10 [get_ports {rdata_s_inf[75]}]
set_max_fanout 10 [get_ports {rdata_s_inf[74]}]
set_max_fanout 10 [get_ports {rdata_s_inf[73]}]
set_max_fanout 10 [get_ports {rdata_s_inf[72]}]
set_max_fanout 10 [get_ports {rdata_s_inf[71]}]
set_max_fanout 10 [get_ports {rdata_s_inf[70]}]
set_max_fanout 10 [get_ports {rdata_s_inf[69]}]
set_max_fanout 10 [get_ports {rdata_s_inf[68]}]
set_max_fanout 10 [get_ports {rdata_s_inf[67]}]
set_max_fanout 10 [get_ports {rdata_s_inf[66]}]
set_max_fanout 10 [get_ports {rdata_s_inf[65]}]
set_max_fanout 10 [get_ports {rdata_s_inf[64]}]
set_max_fanout 10 [get_ports {rdata_s_inf[63]}]
set_max_fanout 10 [get_ports {rdata_s_inf[62]}]
set_max_fanout 10 [get_ports {rdata_s_inf[61]}]
set_max_fanout 10 [get_ports {rdata_s_inf[60]}]
set_max_fanout 10 [get_ports {rdata_s_inf[59]}]
set_max_fanout 10 [get_ports {rdata_s_inf[58]}]
set_max_fanout 10 [get_ports {rdata_s_inf[57]}]
set_max_fanout 10 [get_ports {rdata_s_inf[56]}]
set_max_fanout 10 [get_ports {rdata_s_inf[55]}]
set_max_fanout 10 [get_ports {rdata_s_inf[54]}]
set_max_fanout 10 [get_ports {rdata_s_inf[53]}]
set_max_fanout 10 [get_ports {rdata_s_inf[52]}]
set_max_fanout 10 [get_ports {rdata_s_inf[51]}]
set_max_fanout 10 [get_ports {rdata_s_inf[50]}]
set_max_fanout 10 [get_ports {rdata_s_inf[49]}]
set_max_fanout 10 [get_ports {rdata_s_inf[48]}]
set_max_fanout 10 [get_ports {rdata_s_inf[47]}]
set_max_fanout 10 [get_ports {rdata_s_inf[46]}]
set_max_fanout 10 [get_ports {rdata_s_inf[45]}]
set_max_fanout 10 [get_ports {rdata_s_inf[44]}]
set_max_fanout 10 [get_ports {rdata_s_inf[43]}]
set_max_fanout 10 [get_ports {rdata_s_inf[42]}]
set_max_fanout 10 [get_ports {rdata_s_inf[41]}]
set_max_fanout 10 [get_ports {rdata_s_inf[40]}]
set_max_fanout 10 [get_ports {rdata_s_inf[39]}]
set_max_fanout 10 [get_ports {rdata_s_inf[38]}]
set_max_fanout 10 [get_ports {rdata_s_inf[37]}]
set_max_fanout 10 [get_ports {rdata_s_inf[36]}]
set_max_fanout 10 [get_ports {rdata_s_inf[35]}]
set_max_fanout 10 [get_ports {rdata_s_inf[34]}]
set_max_fanout 10 [get_ports {rdata_s_inf[33]}]
set_max_fanout 10 [get_ports {rdata_s_inf[32]}]
set_max_fanout 10 [get_ports {rdata_s_inf[31]}]
set_max_fanout 10 [get_ports {rdata_s_inf[30]}]
set_max_fanout 10 [get_ports {rdata_s_inf[29]}]
set_max_fanout 10 [get_ports {rdata_s_inf[28]}]
set_max_fanout 10 [get_ports {rdata_s_inf[27]}]
set_max_fanout 10 [get_ports {rdata_s_inf[26]}]
set_max_fanout 10 [get_ports {rdata_s_inf[25]}]
set_max_fanout 10 [get_ports {rdata_s_inf[24]}]
set_max_fanout 10 [get_ports {rdata_s_inf[23]}]
set_max_fanout 10 [get_ports {rdata_s_inf[22]}]
set_max_fanout 10 [get_ports {rdata_s_inf[21]}]
set_max_fanout 10 [get_ports {rdata_s_inf[20]}]
set_max_fanout 10 [get_ports {rdata_s_inf[19]}]
set_max_fanout 10 [get_ports {rdata_s_inf[18]}]
set_max_fanout 10 [get_ports {rdata_s_inf[17]}]
set_max_fanout 10 [get_ports {rdata_s_inf[16]}]
set_max_fanout 10 [get_ports {rdata_s_inf[15]}]
set_max_fanout 10 [get_ports {rdata_s_inf[14]}]
set_max_fanout 10 [get_ports {rdata_s_inf[13]}]
set_max_fanout 10 [get_ports {rdata_s_inf[12]}]
set_max_fanout 10 [get_ports {rdata_s_inf[11]}]
set_max_fanout 10 [get_ports {rdata_s_inf[10]}]
set_max_fanout 10 [get_ports {rdata_s_inf[9]}]
set_max_fanout 10 [get_ports {rdata_s_inf[8]}]
set_max_fanout 10 [get_ports {rdata_s_inf[7]}]
set_max_fanout 10 [get_ports {rdata_s_inf[6]}]
set_max_fanout 10 [get_ports {rdata_s_inf[5]}]
set_max_fanout 10 [get_ports {rdata_s_inf[4]}]
set_max_fanout 10 [get_ports {rdata_s_inf[3]}]
set_max_fanout 10 [get_ports {rdata_s_inf[2]}]
set_max_fanout 10 [get_ports {rdata_s_inf[1]}]
set_max_fanout 10 [get_ports {rdata_s_inf[0]}]
set_max_fanout 10 [get_ports {rresp_s_inf[1]}]
set_max_fanout 10 [get_ports {rresp_s_inf[0]}]
set_max_fanout 10 [get_ports rlast_s_inf]
set_max_fanout 10 [get_ports rvalid_s_inf]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports {in_pic_no[3]}]
set_max_transition 3 [get_ports {in_pic_no[2]}]
set_max_transition 3 [get_ports {in_pic_no[1]}]
set_max_transition 3 [get_ports {in_pic_no[0]}]
set_max_transition 3 [get_ports {in_mode[1]}]
set_max_transition 3 [get_ports {in_mode[0]}]
set_max_transition 3 [get_ports {in_ratio_mode[1]}]
set_max_transition 3 [get_ports {in_ratio_mode[0]}]
set_max_transition 3 [get_ports awready_s_inf]
set_max_transition 3 [get_ports wready_s_inf]
set_max_transition 3 [get_ports {bid_s_inf[3]}]
set_max_transition 3 [get_ports {bid_s_inf[2]}]
set_max_transition 3 [get_ports {bid_s_inf[1]}]
set_max_transition 3 [get_ports {bid_s_inf[0]}]
set_max_transition 3 [get_ports {bresp_s_inf[1]}]
set_max_transition 3 [get_ports {bresp_s_inf[0]}]
set_max_transition 3 [get_ports bvalid_s_inf]
set_max_transition 3 [get_ports arready_s_inf]
set_max_transition 3 [get_ports {rid_s_inf[3]}]
set_max_transition 3 [get_ports {rid_s_inf[2]}]
set_max_transition 3 [get_ports {rid_s_inf[1]}]
set_max_transition 3 [get_ports {rid_s_inf[0]}]
set_max_transition 3 [get_ports {rdata_s_inf[127]}]
set_max_transition 3 [get_ports {rdata_s_inf[126]}]
set_max_transition 3 [get_ports {rdata_s_inf[125]}]
set_max_transition 3 [get_ports {rdata_s_inf[124]}]
set_max_transition 3 [get_ports {rdata_s_inf[123]}]
set_max_transition 3 [get_ports {rdata_s_inf[122]}]
set_max_transition 3 [get_ports {rdata_s_inf[121]}]
set_max_transition 3 [get_ports {rdata_s_inf[120]}]
set_max_transition 3 [get_ports {rdata_s_inf[119]}]
set_max_transition 3 [get_ports {rdata_s_inf[118]}]
set_max_transition 3 [get_ports {rdata_s_inf[117]}]
set_max_transition 3 [get_ports {rdata_s_inf[116]}]
set_max_transition 3 [get_ports {rdata_s_inf[115]}]
set_max_transition 3 [get_ports {rdata_s_inf[114]}]
set_max_transition 3 [get_ports {rdata_s_inf[113]}]
set_max_transition 3 [get_ports {rdata_s_inf[112]}]
set_max_transition 3 [get_ports {rdata_s_inf[111]}]
set_max_transition 3 [get_ports {rdata_s_inf[110]}]
set_max_transition 3 [get_ports {rdata_s_inf[109]}]
set_max_transition 3 [get_ports {rdata_s_inf[108]}]
set_max_transition 3 [get_ports {rdata_s_inf[107]}]
set_max_transition 3 [get_ports {rdata_s_inf[106]}]
set_max_transition 3 [get_ports {rdata_s_inf[105]}]
set_max_transition 3 [get_ports {rdata_s_inf[104]}]
set_max_transition 3 [get_ports {rdata_s_inf[103]}]
set_max_transition 3 [get_ports {rdata_s_inf[102]}]
set_max_transition 3 [get_ports {rdata_s_inf[101]}]
set_max_transition 3 [get_ports {rdata_s_inf[100]}]
set_max_transition 3 [get_ports {rdata_s_inf[99]}]
set_max_transition 3 [get_ports {rdata_s_inf[98]}]
set_max_transition 3 [get_ports {rdata_s_inf[97]}]
set_max_transition 3 [get_ports {rdata_s_inf[96]}]
set_max_transition 3 [get_ports {rdata_s_inf[95]}]
set_max_transition 3 [get_ports {rdata_s_inf[94]}]
set_max_transition 3 [get_ports {rdata_s_inf[93]}]
set_max_transition 3 [get_ports {rdata_s_inf[92]}]
set_max_transition 3 [get_ports {rdata_s_inf[91]}]
set_max_transition 3 [get_ports {rdata_s_inf[90]}]
set_max_transition 3 [get_ports {rdata_s_inf[89]}]
set_max_transition 3 [get_ports {rdata_s_inf[88]}]
set_max_transition 3 [get_ports {rdata_s_inf[87]}]
set_max_transition 3 [get_ports {rdata_s_inf[86]}]
set_max_transition 3 [get_ports {rdata_s_inf[85]}]
set_max_transition 3 [get_ports {rdata_s_inf[84]}]
set_max_transition 3 [get_ports {rdata_s_inf[83]}]
set_max_transition 3 [get_ports {rdata_s_inf[82]}]
set_max_transition 3 [get_ports {rdata_s_inf[81]}]
set_max_transition 3 [get_ports {rdata_s_inf[80]}]
set_max_transition 3 [get_ports {rdata_s_inf[79]}]
set_max_transition 3 [get_ports {rdata_s_inf[78]}]
set_max_transition 3 [get_ports {rdata_s_inf[77]}]
set_max_transition 3 [get_ports {rdata_s_inf[76]}]
set_max_transition 3 [get_ports {rdata_s_inf[75]}]
set_max_transition 3 [get_ports {rdata_s_inf[74]}]
set_max_transition 3 [get_ports {rdata_s_inf[73]}]
set_max_transition 3 [get_ports {rdata_s_inf[72]}]
set_max_transition 3 [get_ports {rdata_s_inf[71]}]
set_max_transition 3 [get_ports {rdata_s_inf[70]}]
set_max_transition 3 [get_ports {rdata_s_inf[69]}]
set_max_transition 3 [get_ports {rdata_s_inf[68]}]
set_max_transition 3 [get_ports {rdata_s_inf[67]}]
set_max_transition 3 [get_ports {rdata_s_inf[66]}]
set_max_transition 3 [get_ports {rdata_s_inf[65]}]
set_max_transition 3 [get_ports {rdata_s_inf[64]}]
set_max_transition 3 [get_ports {rdata_s_inf[63]}]
set_max_transition 3 [get_ports {rdata_s_inf[62]}]
set_max_transition 3 [get_ports {rdata_s_inf[61]}]
set_max_transition 3 [get_ports {rdata_s_inf[60]}]
set_max_transition 3 [get_ports {rdata_s_inf[59]}]
set_max_transition 3 [get_ports {rdata_s_inf[58]}]
set_max_transition 3 [get_ports {rdata_s_inf[57]}]
set_max_transition 3 [get_ports {rdata_s_inf[56]}]
set_max_transition 3 [get_ports {rdata_s_inf[55]}]
set_max_transition 3 [get_ports {rdata_s_inf[54]}]
set_max_transition 3 [get_ports {rdata_s_inf[53]}]
set_max_transition 3 [get_ports {rdata_s_inf[52]}]
set_max_transition 3 [get_ports {rdata_s_inf[51]}]
set_max_transition 3 [get_ports {rdata_s_inf[50]}]
set_max_transition 3 [get_ports {rdata_s_inf[49]}]
set_max_transition 3 [get_ports {rdata_s_inf[48]}]
set_max_transition 3 [get_ports {rdata_s_inf[47]}]
set_max_transition 3 [get_ports {rdata_s_inf[46]}]
set_max_transition 3 [get_ports {rdata_s_inf[45]}]
set_max_transition 3 [get_ports {rdata_s_inf[44]}]
set_max_transition 3 [get_ports {rdata_s_inf[43]}]
set_max_transition 3 [get_ports {rdata_s_inf[42]}]
set_max_transition 3 [get_ports {rdata_s_inf[41]}]
set_max_transition 3 [get_ports {rdata_s_inf[40]}]
set_max_transition 3 [get_ports {rdata_s_inf[39]}]
set_max_transition 3 [get_ports {rdata_s_inf[38]}]
set_max_transition 3 [get_ports {rdata_s_inf[37]}]
set_max_transition 3 [get_ports {rdata_s_inf[36]}]
set_max_transition 3 [get_ports {rdata_s_inf[35]}]
set_max_transition 3 [get_ports {rdata_s_inf[34]}]
set_max_transition 3 [get_ports {rdata_s_inf[33]}]
set_max_transition 3 [get_ports {rdata_s_inf[32]}]
set_max_transition 3 [get_ports {rdata_s_inf[31]}]
set_max_transition 3 [get_ports {rdata_s_inf[30]}]
set_max_transition 3 [get_ports {rdata_s_inf[29]}]
set_max_transition 3 [get_ports {rdata_s_inf[28]}]
set_max_transition 3 [get_ports {rdata_s_inf[27]}]
set_max_transition 3 [get_ports {rdata_s_inf[26]}]
set_max_transition 3 [get_ports {rdata_s_inf[25]}]
set_max_transition 3 [get_ports {rdata_s_inf[24]}]
set_max_transition 3 [get_ports {rdata_s_inf[23]}]
set_max_transition 3 [get_ports {rdata_s_inf[22]}]
set_max_transition 3 [get_ports {rdata_s_inf[21]}]
set_max_transition 3 [get_ports {rdata_s_inf[20]}]
set_max_transition 3 [get_ports {rdata_s_inf[19]}]
set_max_transition 3 [get_ports {rdata_s_inf[18]}]
set_max_transition 3 [get_ports {rdata_s_inf[17]}]
set_max_transition 3 [get_ports {rdata_s_inf[16]}]
set_max_transition 3 [get_ports {rdata_s_inf[15]}]
set_max_transition 3 [get_ports {rdata_s_inf[14]}]
set_max_transition 3 [get_ports {rdata_s_inf[13]}]
set_max_transition 3 [get_ports {rdata_s_inf[12]}]
set_max_transition 3 [get_ports {rdata_s_inf[11]}]
set_max_transition 3 [get_ports {rdata_s_inf[10]}]
set_max_transition 3 [get_ports {rdata_s_inf[9]}]
set_max_transition 3 [get_ports {rdata_s_inf[8]}]
set_max_transition 3 [get_ports {rdata_s_inf[7]}]
set_max_transition 3 [get_ports {rdata_s_inf[6]}]
set_max_transition 3 [get_ports {rdata_s_inf[5]}]
set_max_transition 3 [get_ports {rdata_s_inf[4]}]
set_max_transition 3 [get_ports {rdata_s_inf[3]}]
set_max_transition 3 [get_ports {rdata_s_inf[2]}]
set_max_transition 3 [get_ports {rdata_s_inf[1]}]
set_max_transition 3 [get_ports {rdata_s_inf[0]}]
set_max_transition 3 [get_ports {rresp_s_inf[1]}]
set_max_transition 3 [get_ports {rresp_s_inf[0]}]
set_max_transition 3 [get_ports rlast_s_inf]
set_max_transition 3 [get_ports rvalid_s_inf]
create_clock [get_ports clk]  -period 6  -waveform {0 3}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 3  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 3  [get_ports {in_pic_no[3]}]
set_input_delay -clock clk  -min 0  [get_ports {in_pic_no[3]}]
set_input_delay -clock clk  -max 3  [get_ports {in_pic_no[2]}]
set_input_delay -clock clk  -min 0  [get_ports {in_pic_no[2]}]
set_input_delay -clock clk  -max 3  [get_ports {in_pic_no[1]}]
set_input_delay -clock clk  -min 0  [get_ports {in_pic_no[1]}]
set_input_delay -clock clk  -max 3  [get_ports {in_pic_no[0]}]
set_input_delay -clock clk  -min 0  [get_ports {in_pic_no[0]}]
set_input_delay -clock clk  -max 3  [get_ports {in_mode[1]}]
set_input_delay -clock clk  -min 0  [get_ports {in_mode[1]}]
set_input_delay -clock clk  -max 3  [get_ports {in_mode[0]}]
set_input_delay -clock clk  -min 0  [get_ports {in_mode[0]}]
set_input_delay -clock clk  -max 3  [get_ports {in_ratio_mode[1]}]
set_input_delay -clock clk  -min 0  [get_ports {in_ratio_mode[1]}]
set_input_delay -clock clk  -max 3  [get_ports {in_ratio_mode[0]}]
set_input_delay -clock clk  -min 0  [get_ports {in_ratio_mode[0]}]
set_input_delay -clock clk  -max 3  [get_ports awready_s_inf]
set_input_delay -clock clk  -min 0  [get_ports awready_s_inf]
set_input_delay -clock clk  -max 3  [get_ports wready_s_inf]
set_input_delay -clock clk  -min 0  [get_ports wready_s_inf]
set_input_delay -clock clk  -max 3  [get_ports {bid_s_inf[3]}]
set_input_delay -clock clk  -min 0  [get_ports {bid_s_inf[3]}]
set_input_delay -clock clk  -max 3  [get_ports {bid_s_inf[2]}]
set_input_delay -clock clk  -min 0  [get_ports {bid_s_inf[2]}]
set_input_delay -clock clk  -max 3  [get_ports {bid_s_inf[1]}]
set_input_delay -clock clk  -min 0  [get_ports {bid_s_inf[1]}]
set_input_delay -clock clk  -max 3  [get_ports {bid_s_inf[0]}]
set_input_delay -clock clk  -min 0  [get_ports {bid_s_inf[0]}]
set_input_delay -clock clk  -max 3  [get_ports {bresp_s_inf[1]}]
set_input_delay -clock clk  -min 0  [get_ports {bresp_s_inf[1]}]
set_input_delay -clock clk  -max 3  [get_ports {bresp_s_inf[0]}]
set_input_delay -clock clk  -min 0  [get_ports {bresp_s_inf[0]}]
set_input_delay -clock clk  -max 3  [get_ports bvalid_s_inf]
set_input_delay -clock clk  -min 0  [get_ports bvalid_s_inf]
set_input_delay -clock clk  -max 3  [get_ports arready_s_inf]
set_input_delay -clock clk  -min 0  [get_ports arready_s_inf]
set_input_delay -clock clk  -max 3  [get_ports {rid_s_inf[3]}]
set_input_delay -clock clk  -min 0  [get_ports {rid_s_inf[3]}]
set_input_delay -clock clk  -max 3  [get_ports {rid_s_inf[2]}]
set_input_delay -clock clk  -min 0  [get_ports {rid_s_inf[2]}]
set_input_delay -clock clk  -max 3  [get_ports {rid_s_inf[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rid_s_inf[1]}]
set_input_delay -clock clk  -max 3  [get_ports {rid_s_inf[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rid_s_inf[0]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[127]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[127]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[126]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[126]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[125]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[125]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[124]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[124]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[123]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[123]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[122]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[122]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[121]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[121]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[120]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[120]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[119]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[119]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[118]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[118]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[117]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[117]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[116]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[116]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[115]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[115]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[114]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[114]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[113]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[113]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[112]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[112]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[111]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[111]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[110]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[110]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[109]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[109]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[108]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[108]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[107]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[107]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[106]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[106]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[105]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[105]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[104]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[104]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[103]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[103]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[102]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[102]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[101]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[101]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[100]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[100]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[99]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[99]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[98]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[98]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[97]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[97]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[96]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[96]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[95]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[95]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[94]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[94]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[93]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[93]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[92]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[92]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[91]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[91]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[90]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[90]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[89]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[89]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[88]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[88]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[87]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[87]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[86]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[86]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[85]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[85]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[84]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[84]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[83]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[83]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[82]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[82]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[81]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[81]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[80]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[80]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[79]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[79]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[78]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[78]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[77]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[77]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[76]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[76]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[75]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[75]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[74]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[74]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[73]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[73]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[72]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[72]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[71]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[71]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[70]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[70]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[69]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[69]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[68]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[68]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[67]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[67]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[66]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[66]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[65]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[65]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[64]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[64]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[63]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[63]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[62]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[62]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[61]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[61]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[60]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[60]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[59]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[59]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[58]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[58]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[57]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[57]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[56]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[56]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[55]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[55]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[54]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[54]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[53]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[53]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[52]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[52]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[51]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[51]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[50]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[50]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[49]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[49]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[48]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[48]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[47]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[47]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[46]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[46]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[45]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[45]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[44]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[44]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[43]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[43]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[42]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[42]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[41]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[41]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[40]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[40]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[39]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[39]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[38]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[38]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[37]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[37]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[36]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[36]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[35]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[35]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[34]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[34]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[33]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[33]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[32]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[32]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[31]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[31]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[30]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[30]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[29]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[29]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[28]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[28]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[27]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[27]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[26]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[26]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[25]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[25]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[24]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[24]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[23]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[23]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[22]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[22]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[21]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[21]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[20]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[20]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[19]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[19]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[18]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[18]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[17]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[17]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[16]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[16]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[15]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[15]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[14]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[14]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[13]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[13]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[12]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[12]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[11]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[11]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[10]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[10]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[9]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[9]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[8]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[8]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[7]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[7]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[6]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[6]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[5]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[5]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[4]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[4]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[3]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[3]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[2]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[2]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[1]}]
set_input_delay -clock clk  -max 3  [get_ports {rdata_s_inf[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rdata_s_inf[0]}]
set_input_delay -clock clk  -max 3  [get_ports {rresp_s_inf[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rresp_s_inf[1]}]
set_input_delay -clock clk  -max 3  [get_ports {rresp_s_inf[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rresp_s_inf[0]}]
set_input_delay -clock clk  -max 3  [get_ports rlast_s_inf]
set_input_delay -clock clk  -min 0  [get_ports rlast_s_inf]
set_input_delay -clock clk  -max 3  [get_ports rvalid_s_inf]
set_input_delay -clock clk  -min 0  [get_ports rvalid_s_inf]
set_output_delay -clock clk  -max 3  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 3  [get_ports {out_data[7]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[7]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[6]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[6]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[5]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[5]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[4]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[4]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[3]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[3]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[2]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[2]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[1]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[1]}]
set_output_delay -clock clk  -max 3  [get_ports {out_data[0]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[0]}]
set_output_delay -clock clk  -max 3  [get_ports {awid_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {awid_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {awid_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {awid_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {awid_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {awid_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {awid_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {awid_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[31]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[31]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[30]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[30]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[29]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[29]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[28]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[28]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[27]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[27]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[26]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[26]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[25]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[25]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[24]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[24]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[23]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[23]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[22]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[22]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[21]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[21]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[20]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[20]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[19]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[19]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[18]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[18]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[17]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[17]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[16]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[16]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[15]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[15]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[14]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[14]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[13]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[13]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[12]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[12]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[11]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[11]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[10]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[10]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[9]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[9]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[8]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[8]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[7]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[7]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[6]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[6]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[5]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[5]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[4]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[4]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {awaddr_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {awaddr_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {awsize_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {awsize_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {awsize_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {awsize_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {awsize_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {awsize_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {awburst_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {awburst_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {awburst_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {awburst_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[7]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[7]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[6]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[6]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[5]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[5]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[4]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[4]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {awlen_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {awlen_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports awvalid_s_inf]
set_output_delay -clock clk  -min 0  [get_ports awvalid_s_inf]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[127]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[127]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[126]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[126]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[125]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[125]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[124]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[124]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[123]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[123]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[122]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[122]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[121]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[121]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[120]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[120]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[119]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[119]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[118]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[118]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[117]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[117]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[116]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[116]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[115]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[115]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[114]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[114]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[113]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[113]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[112]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[112]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[111]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[111]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[110]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[110]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[109]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[109]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[108]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[108]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[107]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[107]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[106]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[106]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[105]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[105]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[104]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[104]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[103]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[103]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[102]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[102]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[101]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[101]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[100]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[100]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[99]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[99]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[98]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[98]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[97]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[97]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[96]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[96]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[95]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[95]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[94]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[94]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[93]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[93]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[92]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[92]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[91]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[91]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[90]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[90]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[89]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[89]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[88]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[88]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[87]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[87]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[86]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[86]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[85]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[85]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[84]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[84]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[83]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[83]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[82]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[82]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[81]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[81]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[80]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[80]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[79]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[79]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[78]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[78]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[77]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[77]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[76]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[76]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[75]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[75]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[74]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[74]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[73]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[73]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[72]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[72]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[71]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[71]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[70]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[70]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[69]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[69]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[68]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[68]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[67]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[67]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[66]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[66]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[65]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[65]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[64]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[64]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[63]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[63]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[62]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[62]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[61]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[61]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[60]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[60]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[59]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[59]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[58]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[58]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[57]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[57]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[56]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[56]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[55]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[55]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[54]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[54]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[53]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[53]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[52]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[52]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[51]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[51]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[50]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[50]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[49]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[49]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[48]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[48]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[47]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[47]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[46]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[46]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[45]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[45]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[44]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[44]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[43]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[43]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[42]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[42]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[41]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[41]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[40]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[40]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[39]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[39]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[38]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[38]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[37]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[37]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[36]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[36]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[35]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[35]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[34]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[34]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[33]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[33]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[32]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[32]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[31]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[31]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[30]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[30]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[29]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[29]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[28]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[28]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[27]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[27]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[26]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[26]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[25]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[25]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[24]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[24]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[23]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[23]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[22]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[22]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[21]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[21]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[20]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[20]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[19]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[19]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[18]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[18]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[17]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[17]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[16]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[16]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[15]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[15]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[14]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[14]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[13]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[13]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[12]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[12]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[11]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[11]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[10]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[10]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[9]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[9]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[8]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[8]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[7]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[7]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[6]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[6]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[5]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[5]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[4]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[4]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {wdata_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {wdata_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports wlast_s_inf]
set_output_delay -clock clk  -min 0  [get_ports wlast_s_inf]
set_output_delay -clock clk  -max 3  [get_ports wvalid_s_inf]
set_output_delay -clock clk  -min 0  [get_ports wvalid_s_inf]
set_output_delay -clock clk  -max 3  [get_ports bready_s_inf]
set_output_delay -clock clk  -min 0  [get_ports bready_s_inf]
set_output_delay -clock clk  -max 3  [get_ports {arid_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {arid_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {arid_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {arid_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {arid_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {arid_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {arid_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {arid_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[31]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[31]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[30]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[30]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[29]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[29]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[28]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[28]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[27]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[27]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[26]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[26]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[25]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[25]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[24]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[24]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[23]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[23]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[22]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[22]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[21]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[21]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[20]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[20]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[19]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[19]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[18]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[18]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[17]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[17]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[16]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[16]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[15]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[15]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[14]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[14]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[13]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[13]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[12]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[12]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[11]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[11]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[10]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[10]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[9]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[9]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[8]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[8]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[7]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[7]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[6]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[6]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[5]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[5]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[4]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[4]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {araddr_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {araddr_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[7]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[7]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[6]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[6]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[5]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[5]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[4]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[4]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[3]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[3]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {arlen_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {arlen_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {arsize_s_inf[2]}]
set_output_delay -clock clk  -min 0  [get_ports {arsize_s_inf[2]}]
set_output_delay -clock clk  -max 3  [get_ports {arsize_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {arsize_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {arsize_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {arsize_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports {arburst_s_inf[1]}]
set_output_delay -clock clk  -min 0  [get_ports {arburst_s_inf[1]}]
set_output_delay -clock clk  -max 3  [get_ports {arburst_s_inf[0]}]
set_output_delay -clock clk  -min 0  [get_ports {arburst_s_inf[0]}]
set_output_delay -clock clk  -max 3  [get_ports arvalid_s_inf]
set_output_delay -clock clk  -min 0  [get_ports arvalid_s_inf]
set_output_delay -clock clk  -max 3  [get_ports rready_s_inf]
set_output_delay -clock clk  -min 0  [get_ports rready_s_inf]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports {in_pic_no[3]}]
set_input_transition -min 0.5  [get_ports {in_pic_no[3]}]
set_input_transition -max 0.5  [get_ports {in_pic_no[2]}]
set_input_transition -min 0.5  [get_ports {in_pic_no[2]}]
set_input_transition -max 0.5  [get_ports {in_pic_no[1]}]
set_input_transition -min 0.5  [get_ports {in_pic_no[1]}]
set_input_transition -max 0.5  [get_ports {in_pic_no[0]}]
set_input_transition -min 0.5  [get_ports {in_pic_no[0]}]
set_input_transition -max 0.5  [get_ports {in_mode[1]}]
set_input_transition -min 0.5  [get_ports {in_mode[1]}]
set_input_transition -max 0.5  [get_ports {in_mode[0]}]
set_input_transition -min 0.5  [get_ports {in_mode[0]}]
set_input_transition -max 0.5  [get_ports {in_ratio_mode[1]}]
set_input_transition -min 0.5  [get_ports {in_ratio_mode[1]}]
set_input_transition -max 0.5  [get_ports {in_ratio_mode[0]}]
set_input_transition -min 0.5  [get_ports {in_ratio_mode[0]}]
set_input_transition -max 0.5  [get_ports awready_s_inf]
set_input_transition -min 0.5  [get_ports awready_s_inf]
set_input_transition -max 0.5  [get_ports wready_s_inf]
set_input_transition -min 0.5  [get_ports wready_s_inf]
set_input_transition -max 0.5  [get_ports {bid_s_inf[3]}]
set_input_transition -min 0.5  [get_ports {bid_s_inf[3]}]
set_input_transition -max 0.5  [get_ports {bid_s_inf[2]}]
set_input_transition -min 0.5  [get_ports {bid_s_inf[2]}]
set_input_transition -max 0.5  [get_ports {bid_s_inf[1]}]
set_input_transition -min 0.5  [get_ports {bid_s_inf[1]}]
set_input_transition -max 0.5  [get_ports {bid_s_inf[0]}]
set_input_transition -min 0.5  [get_ports {bid_s_inf[0]}]
set_input_transition -max 0.5  [get_ports {bresp_s_inf[1]}]
set_input_transition -min 0.5  [get_ports {bresp_s_inf[1]}]
set_input_transition -max 0.5  [get_ports {bresp_s_inf[0]}]
set_input_transition -min 0.5  [get_ports {bresp_s_inf[0]}]
set_input_transition -max 0.5  [get_ports bvalid_s_inf]
set_input_transition -min 0.5  [get_ports bvalid_s_inf]
set_input_transition -max 0.5  [get_ports arready_s_inf]
set_input_transition -min 0.5  [get_ports arready_s_inf]
set_input_transition -max 0.5  [get_ports {rid_s_inf[3]}]
set_input_transition -min 0.5  [get_ports {rid_s_inf[3]}]
set_input_transition -max 0.5  [get_ports {rid_s_inf[2]}]
set_input_transition -min 0.5  [get_ports {rid_s_inf[2]}]
set_input_transition -max 0.5  [get_ports {rid_s_inf[1]}]
set_input_transition -min 0.5  [get_ports {rid_s_inf[1]}]
set_input_transition -max 0.5  [get_ports {rid_s_inf[0]}]
set_input_transition -min 0.5  [get_ports {rid_s_inf[0]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[127]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[127]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[126]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[126]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[125]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[125]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[124]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[124]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[123]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[123]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[122]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[122]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[121]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[121]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[120]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[120]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[119]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[119]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[118]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[118]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[117]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[117]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[116]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[116]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[115]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[115]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[114]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[114]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[113]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[113]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[112]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[112]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[111]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[111]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[110]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[110]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[109]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[109]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[108]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[108]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[107]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[107]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[106]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[106]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[105]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[105]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[104]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[104]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[103]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[103]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[102]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[102]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[101]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[101]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[100]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[100]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[99]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[99]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[98]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[98]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[97]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[97]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[96]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[96]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[95]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[95]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[94]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[94]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[93]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[93]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[92]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[92]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[91]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[91]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[90]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[90]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[89]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[89]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[88]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[88]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[87]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[87]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[86]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[86]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[85]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[85]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[84]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[84]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[83]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[83]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[82]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[82]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[81]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[81]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[80]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[80]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[79]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[79]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[78]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[78]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[77]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[77]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[76]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[76]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[75]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[75]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[74]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[74]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[73]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[73]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[72]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[72]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[71]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[71]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[70]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[70]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[69]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[69]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[68]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[68]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[67]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[67]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[66]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[66]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[65]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[65]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[64]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[64]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[63]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[63]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[62]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[62]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[61]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[61]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[60]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[60]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[59]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[59]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[58]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[58]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[57]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[57]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[56]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[56]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[55]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[55]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[54]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[54]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[53]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[53]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[52]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[52]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[51]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[51]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[50]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[50]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[49]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[49]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[48]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[48]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[47]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[47]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[46]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[46]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[45]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[45]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[44]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[44]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[43]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[43]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[42]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[42]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[41]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[41]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[40]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[40]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[39]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[39]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[38]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[38]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[37]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[37]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[36]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[36]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[35]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[35]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[34]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[34]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[33]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[33]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[32]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[32]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[31]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[31]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[30]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[30]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[29]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[29]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[28]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[28]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[27]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[27]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[26]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[26]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[25]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[25]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[24]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[24]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[23]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[23]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[22]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[22]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[21]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[21]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[20]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[20]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[19]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[19]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[18]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[18]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[17]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[17]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[16]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[16]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[15]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[15]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[14]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[14]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[13]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[13]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[12]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[12]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[11]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[11]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[10]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[10]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[9]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[9]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[8]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[8]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[7]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[7]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[6]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[6]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[5]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[5]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[4]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[4]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[3]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[3]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[2]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[2]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[1]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[1]}]
set_input_transition -max 0.5  [get_ports {rdata_s_inf[0]}]
set_input_transition -min 0.5  [get_ports {rdata_s_inf[0]}]
set_input_transition -max 0.5  [get_ports {rresp_s_inf[1]}]
set_input_transition -min 0.5  [get_ports {rresp_s_inf[1]}]
set_input_transition -max 0.5  [get_ports {rresp_s_inf[0]}]
set_input_transition -min 0.5  [get_ports {rresp_s_inf[0]}]
set_input_transition -max 0.5  [get_ports rlast_s_inf]
set_input_transition -min 0.5  [get_ports rlast_s_inf]
set_input_transition -max 0.5  [get_ports rvalid_s_inf]
set_input_transition -min 0.5  [get_ports rvalid_s_inf]
